#pragma once

// PlayerUnknown's Battle Ground Mobile (1.4.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_FontStyleRes_type.BP_STRUCT_FontStyleRes_type
// 0x0030
struct FBP_STRUCT_FontStyleRes_type
{
	int                                                FontSize_0_453DF68E457859D86C19C2AB341F1DCA;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     FontColor_1_C23B5D56422A13425EC0CE8D9960FC64;             // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     FontPath_2_795675834F31CB02AD789D9273FE0B41;              // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     StyleName_3_59E5C6D24A99889D050ABEA64B5E19D9;             // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                FontShadow_4_7E2621134424FC4A0DC1588B789D9612;            // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FontBold_5_6E46C0007BF3F1B43F9E70160B41A934;              // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

