#pragma once

// PlayerUnknown's Battle Ground Mobile (1.4.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_PopularityGift_type.BP_STRUCT_PopularityGift_type
// 0x0090
struct FBP_STRUCT_PopularityGift_type
{
	int                                                PriceType_0_24103B8041D3955A0B649CBD0E5743F5;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GiftId_1_73BCA4000296D1C2338B93AF099EC424;                // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ItemName_2_59613A4022927A77049010190BBE9E75;              // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                MaxDevote_3_010F79803A776316095F91000D617135;             // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                popularity_4_1921AC8055DFC3503756D47508F2C7D9;            // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Price_5_59D79300427B069A65F244C90D839E55;                 // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BuySourceDesc_6_3730DE401FD50DA952EEA7540546C7C3;         // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     GiftIcon_7_2E0B3B006006E856028E01AF0EC421CE;              // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                BuySource_8_5D9B9E801C60D17C2A65A1D30F6B5545;             // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     GiftAni_9_1D7E7EC00A06A55D4DDD4A4509EC4BD9;               // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ItemID_10_1BF0FD40544915C1152137F20A4BBD04;               // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GiftOrder_11_158417C05BFE96417053B1B30C5B1322;            // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ExclusiveAccess_15_5D3278C01E70B03B6081AD3000888493;      // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                CanMessage_16_0D4E8C0034DEC4F80AD7A1180F134095;           // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Intimacy_17_6D3A05C01AE226DF3CAB20BC04B4EE69;             // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     GiftAni2_19_28DD2B40096B80A502FDD1260EC4BD52;             // 0x0054(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GiftAni3_20_28DE2B80096B80A602FDD1210EC4BD53;             // 0x0060(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DevoteCond_21_053431003393588E15686AF00A7089A4;           // 0x006C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     LimitItemIDs_22_607C79C05925D95304D9BF820AC521D3;         // 0x0078(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Appid_23_359051C03647341320774BD90D9C6734;                // 0x0084(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

