#pragma once

// PlayerUnknown's Battle Ground Mobile (1.4.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ArenaSegmentConfig_type.BP_STRUCT_ArenaSegmentConfig_type
// 0x003C
struct FBP_STRUCT_ArenaSegmentConfig_type
{
	struct FString                                     BigIcon_0_1B62704077A956854669C5D80A6A736E;               // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                SegmentID_1_267821806A43506E11B3ED190DB173F4;             // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SegmentMinScore_2_2FDEA6400078E87F534C29050388F295;       // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SegmentName_3_355C1E805B1679D25EA4543001746B85;           // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                SegmentType_4_0C2886C06B91302F5EA0CFBE0172ADD5;           // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SubIcon_6_2130B64038DD15F3291609280827737E;               // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SmallIcon_7_44822A007BC7BC583E83C77F07BBD6FE;             // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

