#pragma once

// PlayerUnknown's Battle Ground Mobile (1.4.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_AvatarFrame_type.BP_STRUCT_AvatarFrame_type
// 0x0064
struct FBP_STRUCT_AvatarFrame_type
{
	int                                                Type_0_1A0A9F0743331BBE49AADB988DC87C90;                  // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Desc_1_AC45D7034D7DDDC90D52E19BF6D66EF9;                  // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Name_2_401DF90F47F3FF259DF5AD890925B071;                  // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_3_831225F64111B05931B2D0B74884A6BD;                    // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     DescGet_4_E78748484096828FA71D5E85901FD57B;               // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     IconBig_5_82F9A60A40DA032B376321A0896F07F2;               // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Icon_6_7C7ADBE24A1E2C45A54BC7BD91D84759;                  // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DescTime_7_684743074A1D090755252DAA2F6832B5;              // 0x0044(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                AppleAuditHide_8_C3DCAE874E4C89FB670303A48501283C;        // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DefaultDisplay_9_43871EC03BAE8EB1607A95390AB61819;        // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ShowTime_10_6F3484001A56164C305DF94C07184815;             // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

