#pragma once

// PlayerUnknown's Battle Ground Mobile (1.4.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_LinkStyleRes_type.BP_STRUCT_LinkStyleRes_type
// 0x0044
struct FBP_STRUCT_LinkStyleRes_type
{
	int                                                FontSize_0_A45833814314772AA0F40587CB0DD2DB;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     StyleName_1_01B6B5F543AB25F3AC37A48BDB25594A;             // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               UnderLine_2_89F7D6C64387435409BA1A84421C6F57;             // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	struct FString                                     FontColor_3_D2BCBAE447301225879E948D36B9BD28;             // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     FontPath_4_0A5E92CA4BB4DAF4821590AD6C060516;              // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     UnderlineHovered_5_424C54807C6FD1C2456BD6E903FBBD94;      // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     UnderlineNormal_6_32EFDB8066C6BB726F251E7E03A0042C;       // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

