#pragma once

// PlayerUnknown's Battle Ground Mobile (1.4.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ConsumableBPTable_type.BP_STRUCT_ConsumableBPTable_type
// 0x0034
struct FBP_STRUCT_ConsumableBPTable_type
{
	struct FString                                     CName_0_3A46A7E346B57C4E5F45619DF5906006;                 // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Path_1_81463AA644426E53AF3240A311C1D4E0;                  // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_2_AD337FD040A1235FE67F55BBA677262B;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Wrapper_3_66935E806EA99C4E6B9844A505FF3052;               // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     LobbyPath_4_60DFC780056E426A3B985A350FD8F288;             // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

