#pragma once

// PlayerUnknown's Battle Ground Mobile (1.4.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_DiySuitColorConfig_type.BP_STRUCT_DiySuitColorConfig_type
// 0x0030
struct FBP_STRUCT_DiySuitColorConfig_type
{
	int                                                ItemID_1_15B6748029F10AF4167429B5070FACB4;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BPUrl_2_1E617EC03A4F456D2C223D0106670E5C;                 // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Cost_3_63AB73C07271FCFF75FDA1880D66A384;                  // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_4_0CD2D0C023DDAD912AEEEF92052D66D4;                    // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ColorG_6_55EE7F00036767CC6B99C3BD06A11B07;                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ColorB_7_55E97DC0036767C76B99C3A206A11B02;                // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ColorR_8_55F981C0036767D76B99C3B206A11B12;                // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ColorName_9_56C1CD807D19C79E1E3D3EDE01B12E25;             // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

