#pragma once

// PlayerUnknown's Battle Ground Mobile (1.4.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsBadge_type.BP_STRUCT_CorpsBadge_type
// 0x0030
struct FBP_STRUCT_CorpsBadge_type
{
	struct FString                                     BigIconPath_0_10CC26002C2272C4426923F90B6405C8;           // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_1_5727FF4053D9C66568AE85A909693024;                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     IconPath_2_038F818050E2694643DA924F014A58A8;              // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Name_3_56563C4042608BF33377F2DB0931BF55;                  // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                TabPosi_4_17AFE880638188BE77062DBF05E20589;               // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                UnLockLv_5_04857F8051FE2B7A53B16D630C5CAF66;              // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

