#pragma once

// PlayerUnknown's Battle Ground Mobile (1.4.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_VehicleRefitPatternTable_type.BP_STRUCT_VehicleRefitPatternTable_type
// 0x003C
struct FBP_STRUCT_VehicleRefitPatternTable_type
{
	int                                                IconScale2_0_46572E4071F9B3293BE305FF087656B2;            // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     IconPath2_1_024EF7804CE8216627C3CAFF038879F2;             // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                IconScale1_2_46562E0071F9B3283BE305F8087656B1;            // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     IconPath1_3_024DF7404CE8216527C3CAFC038879F1;             // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_4_3B4768C07AEB475737EB9B560A7BEF14;                    // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     IconOffset_5_59F5A18037D665B02424026A0AB3EDF4;            // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PatternBPPath_6_4B5944C06FBA413D7EB727A808597AD8;         // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

