#pragma once

// PlayerUnknown's Battle Ground Mobile (1.4.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RankIntegralLevel_type.BP_STRUCT_RankIntegralLevel_type
// 0x0088
struct FBP_STRUCT_RankIntegralLevel_type
{
	int                                                IntegralType_0_5DB652C74A6C2C5E4B1123A62ADC38A8;          // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     IntegralTypeName_1_37066B404ACB346A9C01D683DD3A29FB;      // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     FrameID_2_FA51FC0F47FB8AEB41067AB1A00E044D;               // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                MinIntegral_3_8BCC404B4E31165611A2F3A5DCA7F9EB;           // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Level_4_4248BF2F4F85F33AF1FFF8B269550E92;                 // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IntegralTypeOrder_5_E1D966464BA0136A4682EA8533722D30;     // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Name_6_B98FA8AA4955E5E532285FA0BC38606D;                  // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                NextIntegralScore_7_194CC840003BFCBD1B7B7E14029BE565;     // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                StarNum_8_045B8680677A2C3C3C50D91C069A9F6D;               // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BigIcon_9_55E7FAC04C1A035F0AEAB48904C9149E;               // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SmallIcon_10_3B6D3480778CAC664F339B4106DA305E;            // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SubIcon_11_5BB640C031E57E65018BD3BD0684148E;              // 0x0054(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                NextSeasonIntegralScore_12_010B22802CC106BA61EB81370B236155;// 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BigMesh_13_2B197BC07A689F070AE3691404CAD658;              // 0x0064(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SubMaterial_14_0B216A40672064491BC4738C027A0AAC;          // 0x0070(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SubMesh_15_30E7C1C060341A0D018996830685D648;              // 0x007C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

