#pragma once

// PlayerUnknown's Battle Ground Mobile (1.4.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_LobbyCameraInfo_type.BP_STRUCT_LobbyCameraInfo_type
// 0x00C4
struct FBP_STRUCT_LobbyCameraInfo_type
{
	struct FString                                     FieldOfView_0_774965C01E82608B78610A1F0CEEDE07;           // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CameraLocationWidth_1_2795B9402C37D69925FC607507CC5AB8;   // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CameraLocation_2_337EB9401C40211F6EB5E73A0F1A116E;        // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CameraScale_3_187545000777A7B8563DCE430BD94005;           // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CameraLocationX_4_0D8E2F407AB6F6691CDF865C01A117C8;       // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                CameraID_5_2E8DAE400C973D5F0716503A0A82BED4;              // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BlendTime_6_48FF35C029EC8B7B17E35E2A01AA1EF5;             // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ProjectMode_7_05044FC04CBC5C8904E0C53F08075A45;           // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CameraRotation_8_1901DF00292BF94210F0DE080C2A13CE;        // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CameraAnimationPath_9_4B7A7640586729291B2F6F2408CB7BE8;   // 0x0064(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CameraAnimationPathLong_10_3EB85A40709683A7360F690B0BE5FF37;// 0x0070(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     AvatarPosition_11_2DCEE5C039B936A35A436F3D04B414DE;       // 0x007C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     AvatarPositionWidth_12_699EA5C07AF9251538B9AA9D0E76BAE8;  // 0x0088(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     AvatarPositionLong_13_2F4DC9C079A02A0560B7794104E7A257;   // 0x0094(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     LightLevelName_14_4980F50004BC70381F310B1E0DE28A45;       // 0x00A0(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SceneName_15_3B50D48067150C2E7CDC093801ABE845;            // 0x00AC(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     LightLevelNameLow_16_42AEE18036CF9E14443D542508A45D47;    // 0x00B8(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

