#pragma once

// PlayerUnknown's Battle Ground Mobile (1.4.0) SDK

#include "PUBGM_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_LobbySceneSkinTable_type.BP_STRUCT_LobbySceneSkinTable_type
// 0x004C
struct FBP_STRUCT_LobbySceneSkinTable_type
{
	struct FString                                     SkinStreamLevelName_0_3781FCC026A707C5085B0B8D0763C135;   // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                SkinID_1_11FAE6C0633AFB313233DCF907356724;                // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SkinStyleKey1_6_3E24BE404C85800940BF19450D807901;         // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SkinStyleKey2_7_3E25BE804C85800A40BF19440D807902;         // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SkinStyleKey3_8_3E26BEC04C85800B40BF19470D807903;         // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SkinStyleKey4_9_3E27BF004C85800C40BF19460D807904;         // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SkinStyleKey5_10_3E28BF404C85800D40BF19410D807905;        // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SkinStyleKey6_11_3E29BF804C85800E40BF19400D807906;        // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     hallMaskPic1_12_547A3CC06D45501D04D1A1C60CD4F9A1;         // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     hallMaskPic2_13_547B3D006D45501E04D1A1C50CD4F9A2;         // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     hallMaskPic3_14_547C3D406D45501F04D1A1C40CD4F9A3;         // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

